<<<Router R1 configuration>>>


R1#conf t
R1(config)#hostname R1
R1(config)#ip dhcp pool LAN
R1(config-dhcp)#network 10.1.1.0 255.255.255.0
R1(config-dhcp)#default-router 10.1.1.1
R1(config-dhcp)#lease infinite
!
R1(config)#interface Tunnel1
R1(config-if)#ip address 172.16.0.1 255.255.255.252
R1(config-if)#tunnel source 10.1.3.2
R1(config-if)#tunnel destination 10.2.3.2
!
R1(config)#interface FastEthernet0/0
R1(config-if)#description R1<--->R3
R1(config-if)#ip address 10.1.3.2 255.255.255.252
!
R1(config)#interface FastEthernet1/0
R1(config-if)#description LAN-Address
R1(config-if)#ip address 10.1.1.1 255.255.255.0
!
R1(config)#interface FastEthernet2/0
R1(config-if)#description R1<--->R2
R1(config-if)#ip address 10.1.2.1 255.255.255.252
!
R1(config)#router eigrp EIGRP-STUB-SITE
R1(config-router)#address-family ipv4 unicast autonomous-system 10
  !
  topology base
  exit-af-topology
R1(config-router)#network 10.1.1.0 0.0.0.255
R1(config-router)#network 10.1.2.0 0.0.0.3
R1(config-router)#network 10.1.3.0 0.0.0.3
R1(config-router)#network 172.16.0.0 0.0.0.3
 exit-address-family
!

