<<<Router R1 Configuration>>>

R1#conf t
R1(config)#key chain EIGRPKEY
R1(config-keychain)#key 2
R1(config-keychain-key)#key-string CISCO
R1(config)#interface Loopback0
R1(config-if)#description Loopback-interface
R1(config-if)#ip address 192.168.1.1 255.255.255.255
!
R1(config)#interface Ethernet1/0
R1(config-if)#description R1<--->R2
R1(config-if)#ip address 10.12.1.1 255.255.255.0
R1(config-if)#ip authentication mode eigrp 100 md5
R1(config-if)#ip authentication key-chain eigrp 100 EIGRPKEY
!
R1(config)#interface Ethernet1/1
R1(config-if)#description LAN-Address
R1(config-if)#ip address 10.11.11.1 255.255.255.0
!
R1(config)#router eigrp 100
R1(config-router)#network 10.11.11.1 0.0.0.0
R1(config-router)#network 10.12.1.1 0.0.0.0
R1(config-router)#network 192.168.1.1 0.0.0.0
R1(config-router)#passive-interface Ethernet1/1
!


<<<Router R2 Configuration>>>

R2#conf t
R2(config)#key chain EIGRPKEY
R2(config-keychain)#key 2
R2(config-keychain-key)#key-string CISCO
R2(config)#interface Loopback0
R2(config-if)#description Loopback-interface
R2(config-if)#ip address 192.168.2.1 255.255.255.255
!
R2(config)#interface Ethernet1/0
R2(config-if)#description R2<--->R1
R2(config-if)#ip address 10.12.1.2 255.255.255.0
!
R2(config)#interface Ethernet1/1
R2(config-if)#description LAN-Address
R2(config-if)#ip address 10.22.22.1 255.255.255.0
!
R2(config)#router eigrp EIGRP-NAME-MODE
R2(config-router)#address-family ipv4 unicast autonomous-system 100
R2(config-router-af)#af-interface default
R2(config-router-af-interface)#authentication mode md5
R2(config-router-af-interface)#authentication key-chain EIGRPKEY
R2(config-router-af)#af-interface ethernet 1/1
R2(config-router-af-interface)#passive-interface
R2(config-router-af)#topology base
R2(config-router-af-topology)#network 0.0.0.0
!

