<<<Router R1 configuration>>>


R1#config t
R1(config)#hostname R1
R1(config)#interface Loopback0
R1(config-if)#ip address 1.1.1.1 255.255.255.255
!
R1(config)#interface FastEthernet0/0
R1(config-if)#description R1<--->R2
R1(config-if)#ip address 10.1.1.1 255.255.255.252
!
R1(config)#router bgp 65100
R1(config-router)#bgp log-neighbor-changes
R1(config-router)#neighbor 2.2.2.2 remote-as 65200
R1(config-router)#neighbor 2.2.2.2 update-source Loopback0
!
R1(config)#ip route 2.2.2.2 255.255.255.255 10.1.1.2
!



<<<Router R2 configuration>>>


R2#config t
R2(config)#hostname R2
R2(config)#interface Loopback0
R2(config-if)#ip address 2.2.2.2 255.255.255.255
!
R2(config)#interface FastEthernet0/0
R2(config-if)#description R2--->R1
R2(config-if)#ip address 10.1.1.2 255.255.255.252
!
R2(config)#interface FastEthernet1/0
R2(config-if)#description R2<--->R3
R2(config-if)#ip address 10.2.1.1 255.255.255.252
!
R2(config)#router bgp 65200
R2(config-router)#neighbor 1.1.1.1 remote-as 65100
R2(config-router)#neighbor 1.1.1.1 update-source Loopback0
R2(config-router)#neighbor 3.3.3.3 remote-as 65300
!
R2(config)#ip route 1.1.1.1 255.255.255.255 10.1.1.1
!


<<<Router R3 configuration>>>


R3#conf t
R3(config)#hostname R3
R3(config)#interface Loopback0
R3(config-if)#ip address 3.3.3.3 255.255.255.255
!
R3(config)#interface FastEthernet0/0
R3(config-if)#description R3<--->R2
R3(config-if)#ip address 10.2.1.2 255.255.255.252
!
R3(config)#router bgp 65300
R3(config-router)#bgp log-neighbor-changes
R3(config-router)#neighbor 2.2.2.2 remote-as 65200
R3(config-router)#neighbor 2.2.2.2 update-source Loopback0
!
